{
  "id": null,
  "numberOfColumns": 8,
  "offsetColumns": 2,
  "renderOrder": 1,
  "showInNotebook": false,
  "showInNotebookAt": null,
  "page": null,
  "markdownContent": "To start creating your own *Lives in Transit*--Chapter you first of all want to clone the repository of an existing game, for example this <a href=\"https://github.com/uzh/lit-tutorial\" class=\"underlined\" target=\"_blank\">tutorial</a>. It's best to take a smaller game instead of for example *Plantation Lives* to keep an overview of what you're doing and facilitate finding bugs. Next we'd personally advice you to take a step back from the computer and start planning out your game on a piece a paper (or a text file if you do like to keep it digital). Note down the pages you want to create and the modules, which you'd like to have on them. It's also really useful to simply draw the pages to have a visual representation. If you've familiarized yourself with the 12 columns of *Marugoto*, you can even go so far and already define the values for *numberOfColumns*, *offsetColumns* and *renderOrder*. For the general structure of the game and branching, it's also really helpful to draw a tree for how the game should progress and which decisions a player can make. When you finished mapping out your game and the pages you can go into your repository and start editing the existing files. For the start the easiest way is to just edit the existing files in the folders. So for your first page you'd for example change the title of T1.1 in the `page.json`, delete the **videoComponent** and the **audioComponent** as you maybe don't need them and edit the **textComponents**. Then you'd change the the image shown by adding the one you want to display to the `resources` folder and referring to it in `imageComponent.json`. Congratulations, you've just created your first own *Lives in Transit*--page! These are the basic steps to get to results quickly.<br><br>If you're interested in the complete functionality of *Marugoto*, be sure to check out the <a href=\"https://lives-in-transit.readthedocs.io/en/latest/\" class=\"underlined\" target=\"_blank\">writers' guide</a>. Pull requests are always welcome for both games and their engine. Please be in touch <a href=\"https://github.com/uzh/marugoto\" class=\"underlined\" target=\"_blank\">via GitHub</a> or <a href=\"https://twitter.com/transitlives\" class=\"underlined\" target=\"_blank\">Twitter</a>."
}
