{
  "id": null,
  "numberOfColumns": 8,
  "offsetColumns": 2,
  "renderOrder": 1,
  "showInNotebook": false,
  "showInNotebookAt": null,
  "page": null,
  "markdownContent": "The topic *exercises* will be split into two pages, one regarding **textExercise** (2a) and one for **dateExercise** (2b). A **textExercise** is one of the most common and versatile tasks you can give a player. You problably already encountered multiple of them playing the other games. They can be used in various different ways; some game-creators will task the player with writing about their thoughts, others to compose a tweet, again others to write a research outline. You almost always want to have the content, the player has written in the exercise, recorded in the notebook. Because of this you must have a **notebookEntry** file in the page folder. In that you can also define the title of the notebook entry.<br><br>If you look at the **textExercise1.json** file (relating to the exercise below this text) in the repository you'll see the familiar variables from previous page. The two notebook related variables, you might have already spotted in other modules, will be discussed in detail on T1.3. Relevant for you are *placeholderText*,*textSolutions* and *maxLength*. The first variable defines which text is deplayed **before** a player clicks into the exercise. *maxLength* defines the maximum amount of characters the player can type into the exercise, so for a tweet the maximum would be 280 characters.<br><br>*textSolutions* defines the correct answer for the exercise, which the player has to fill in to continue. This can be an exact value, like we see on the next page with the **dateExercise** or something like a character minimum, like on this page. To progress to T1.2b you must have at least 300 characters written in the **textExercise**, which is set to length, so it's just looking at the amount of characters. To keep the player from progressing until they have correctly completed the exercise, you'll also have to edit the **pageTransition** file. We'll look at **pageTransitions** and structuring the game in chapter 2, so for now just look at the variable *criteria*. *pageCriteria* has to be *visited* so that *Marugoto* knows that the player is on the page solving the exercise. The next variable, *exerciseCriteria*, defines what has to be achieved to proceed. In most cases this is *correctInput*. The other two filled in variables, *affectedExercise* and *affectedPage*, are for *Marugoto* to know where it has to check if the criteria were achieved. Here you need to define both the **textExercise** file and the **page** file it's located on.<br><br>The next page will dicuss **dateExercise**. If you want to proceed, you must fill in the **textExercise** first. Feel free to actually write something or just copy and past this text."
}
