{
  "id": null,
  "numberOfColumns": 8,
  "offsetColumns": 2,
  "renderOrder": 1,
  "showInNotebook": false,
  "showInNotebookAt": null,
  "page": null,
  "markdownContent": "The topic *exercises* will be split into two pages, one for **textExercise** (2a) and one for **dateExercise** (2b). A **textExercise** is one of the most common and versatile tasks you can give a player. You problably already encountered many of them while playing the other games in LiT. They can be used in various different ways: some game-creators will task the player to record their thoughts about a particular issue, others to compose a tweet, others again to write a research outline.<br><br>For pedagogical reasons, you will generally want the player's thoughts to be preserved and time-stamped (so that both the player and the offline classroom teacher can see how the player's thinking changed while playing the game). For this reason, you will almost always want to have the player's input in the textExercise saved into the Notebook (which can be downloaded at the end of the game). To do this, you must always have a **notebookEntry** file in the page folder. In this **notebookEntry** file you can also define the heading of the individual entry as it will appear in your Notebook. And by setting the *showInNotebookAt* variable to pageExit, you make sure that the player's input isn't saved in the Notebook until they exit this page and transition to the next page.<br><br>Now, if you look at the repository's `textExercise1.json` file (relating to the exercise below this text module), you'll see the familiar variables from previous page. The two notebook-related variables, which you might have already spotted in other modules, will be discussed in detail shortly (on page T1.3). Relevant for you here are the variables, *placeholderText*, *textSolutions* and *maxLength*. The first variable defines which text is displayed **before** a player clicks into the exercise. *maxLength* defines the maximum amount of characters the player can type into the exercise, so for a tweet the maximum would be 280 characters. *textSolutions* defines the correct answer for the exercise. This can be an exact value, like we see on the next page with the **dateExercise**, or a character minimum (as below). That is, to transition to T1.2b you must input at least 300 characters in the **textExercise** module: and because the variable is set to length, Marugoto will be counting the length of your input.<br><br>To prevent the player from progressing until they have correctly completed the exercise, you'll also have to edit the **pageTransition** file. We'll look at **pageTransitions** and structuring the game in chapter 2, so for now just look at the variable called *criteria*. *exerciseCriteria* defines what has to be achieved to proceed. In most cases this is *correctInput*. The other two inputted variables, *affectedExercise* and *affectedPage*, are for *Marugoto* to know where it has to check if the criteria were achieved. Here you need to define both the **textExercise** file and the **page** file it's located on.<br><br>The next page will dicuss **dateExercise**. If you want to proceed, you must fill in the **textExercise** first. Feel free to actually write something---or, if you're tremendously lazy, just copy and paste text from the last couple of paragraphs."
}
