{
  "id": null,
  "numberOfColumns": 8,
  "offsetColumns": 2,
  "renderOrder": 1,
  "showInNotebook": false,
  "showInNotebookAt": null,
  "page": null,
  "markdownContent": "Welcome to the *Lives in Transit* Tutorial, where we teach you (yes, you!) how to create your own *Lives in Transit* storyline. To achieve this, you should already have some basic Git knowledge. *Marugoto*, the engine on which *Lives in Transit* is based, uses JSON files to define the contents of a game. It's easy to read and you'll be able to pick it up quickly. To follow the tutorial it's best to have the repository for the tutorial open in another tab or window. You can find it <a href=\"https://github.com/uzh/lit-tutorial\" class=\"underlined\" target=\"_blank\">here</a>. Another thing you'll definitely find useful is the <a href=\"https://lives-in-transit.readthedocs.io/en/latest/\" class=\"underlined\" target=\"_blank\">writers' guide</a>, where you can look things up quickly. This tutorial won't discuss all of the functionality *Marugoto* has, as some of it is too complicated for a basic introduction or simply has not been developed yet. When playing this storyline focus on the discussed variables. They will allow you to get started with creating your own game. If you're interested in further information about the possibilites of *Marugoto* refer to the aforementioned writers' guide. Let's get on with it, shall we?<br><br>The page you're currently reading relates to the folder T1.1 in Chapter 1. It'll discuss the basic modules (that is, components) you can add to a page. There are four of these---**textComponent**, **imageComponent**, **videoComponent**, and **audioComponent**---and we'll see how to edit the size and position of them. This text module you're reading right now relates to <code><nobr>textComponent1.json</nobr></code> and its contents can be found in the variable *markdownContent*.<br><br>If you take a look at the file, you'll see a number of other variables. Relevant for you at this point are *numberOfColumns*, *offsetColumns*, and *renderOrder*. The first one, *numberOfColumns*, defines the width of a module on the webpage as you read it in your browser. A *Marugoto* page is subdivided into 12 equally spaced vertical columns. You can define how many of these 12 columns a module will use. This text is using 8, which is a nice-looking size for many modules. The next variable, *offsetColumns*, enables you to define the space to the left of the module---and thus, by incredible mathematical deduction, also to its right. The value determines the amount of columns on the left side of the module. In this case, the *offsetColumns* is 2, which---when you add 2 to the module width (8)---also leaves 2 columns on the right side, and thus the module nicely centred (2+8+2). Thus, to place the same text slightly off-centre to the left you would use a value of 1 in the *offsetColumns*, which leaves 3 columns on the right side and so on (1+8+3). If you have multiple modules on one page you also have to tell *Marugoto* in which order it should display the modules. This is done using the *renderOrder* variable. *Marugoto* renders from **top-left to bottom-right**, the same way you're reading this text. This text has the *renderOrder* of 1, so it's displayed at the very top of the page. The picture below has the value 2 and the text beside it the value 3. Finally, in a **textComponent** you can add manual linebreaks with `<br>` or a double linebreak with `<br><br>`"
}
