{
  "id": null,
  "numberOfColumns": 5,
  "offsetColumns": 1,
  "renderOrder": 2,
  "showInNotebook": false,
  "showInNotebookAt": null,
  "page": null,
  "markdownContent": "### Understanding <tt>textComponent&#46;json</tt> files\nWelcome to the first page (T1.1) of the *Lives in Transit* (LiT) tutorial, whichs uses the game interface itself to show you how to write your own content. Where relevant, we'll even link to the source files themselves, such as <a class='underlined' href='https://github.com/uzh/lit-tutorial/blob/master/chapter1/T1.1/textComponent&#46;json' target='_blank'>the file that defines this paragraph</a>.\n\nIn this and the next few pages, we'll focus on page layout and design. Please don't worry about the *Notebook* feature, or the *Inbox* features just yet, and please *try* to concentrate on what we're saying without being distracted by emails, telephone calls etc., okay?<br><br>So, the first thing to say is that your JSON files will be stored in various folders and sub-folders on your computer, always with a <tt>&#46;json</tt> file extension. This tutorial has several <tt>chapter</tt> folders, and each <tt>chapter</tt> folder comprises (i) a <tt>chapter&#46;json</tt> file and (ii) <tt>page</tt> subfolders.<br><br>In these seqentially named <tt>page</tt> subfolders (this one is [T1.1](https://github.com/uzh/lit-tutorial/tree/master/chapter1/T1.1)), you will store all the JSON files that you need in order to give the page in your internet browser its basic functionality. At the very least, these will be:\n1. a <tt>page&#46;json</tt> file: this is the \"home\" file for each *page* folder\n2. a <tt>pageTransition1&#46;json</tt> file: this will enable the player to move from one page to the next on their browser\n3. almost always, a <tt>textComponent1&#46;json</tt> file: that's what you're reading *right now*.\n\nIncidentally, before we go on: the <tt>textComponent&#46;json</tt> files are written in <a class='underlined' href='https://guides.github.com/features/mastering-markdown/' target='_blank'>basic markdown</a>, a simple formatting language that you'll need to learn to create engaging context. We can come back to this later on."
}
