{
  "id": null,
  "numberOfColumns": 8,
  "offsetColumns": 2,
  "renderOrder": 1,
  "showInNotebook": false,
  "showInNotebookAt": null,
  "page": null,
  "markdownContent": "Welcome to the *Lives in Transit*--Tutorial, where we teach you (yes, you!) how to create your own *Lives in Transit*--Chapter. To achieve this, you should already have some basic Git knowledge. *Marugoto*, the engine *Lives in Transit* is based on, uses JSON files to define the contents of a game. It's easy to read and you'll be able to pick it up quickly. To follow the tutorial it's best to have the repository for the tutorial open in another tab or window. You can find it <a href=\"https://github.com/uzh/lit-tutorial\" class=\"underlined\" target=\"_blank\">here</a>. Let's get into it, shall we?<br><br>The page you're currently reading relates to the folder T1.1 in Chapter 1. It'll discuss the basic modules you can add to a page (**textComponent**, **imageComponent**, **videoComponent**, and **audioComponent**) and how to edit the size and position of them. This text module you're reading right now relates to <code><nobr>textComponent1.json</nobr></code> and its contents can be found in the variable *markdownContent*. If you take a look at the file, you'll see a number of other variables. Relevant for you at this point are *numberOfColumns*, *offsetColumns*, and *renderOrder*. The first one, *numberOfColumns* defines the width of a module. A *Marugoto* page is subdivided into 12 evenly spaced vertical columns. You can define how many of these 12 columns a module will use. This text is using 8, which is a nice looking size for most modules. The next variable, *offsetColumns*, enables you to define the space left and right to the module. The value determines the amount of columns on the left side of the module. In this case it's 2, which -- because math is a thing -- also leaves 2 columns on the right side and the module nicely centered. To place for example a text slightly off-centre to the left you would use the *offsetColumns* value 1 which leaves 3 columns on the right side and so on. If you have multiple modules on one page you also have to tell *Marugoto* in which order it should display the modules. This is done using the *renderOrder* variable. *Marugoto* renders from **top-left to bottom-right**, the same way you're reading this text. This text has the *renderOrder* of 1, so it's displayed at the very top of the page. The picture below has the value 2 and the text beside it the value 3. In a **textComponent** you can add manual linebreaks with `<br>`, in this case the introductory paragraph is seperated from this paragraph with the addition of `<br><br>`. "
}
