{
  "id": null,
  "numberOfColumns": 8,
  "offsetColumns": 2,
  "renderOrder": 3,
  "showInNotebook": false,
  "showInNotebookAt": null,
  "page": null,
  "markdownContent": "But it may be that you want the player's transition options to be dependent on the pages they have or have not previously visited. In this Tutorial, we can't demonstrate this functionality, as you have visited all of its pages. But there are multiple examples in *Plantation Lives* of transitions that are only available to the player *if* they have visited a certain page. For example, the option to go to the Hawaii Plantation Village museum should only come *after* they have been to the Hamilton Library. For such a condition, the *pageCriteria* variable would be set to *visited*, and the *affectedPage* to the `page.json` the player must have visited. In case of *Plantation Lives* only if the player had visited the Hamilton Library would the **pageTransition** file offering the *buttonText* leading to the Hawaii Plantation Village museum appear.<br><br>This means that your page folder may need multple **pageTransition** files, even if the player only ever sees one or two of them. (For example, the penultimate page of one storyline in *Plantation Lives* has 6 **pageTransition** files, but the player will only see one *buttonText*.) When you consider that the variables are *visited*, *notVisited*, *visitedAny* (page A *or* page B) and *notVisitedAny*, you can see that the choices are endless. You can also have multiple pages defined in, say, *notVisitedAny*. In this case, the variable should be renamed from *affectedPage* to *affectedPagesIds*. And it is also possible to have combinations which are not *or* but rather *and*. You might want the page transition to be dependent on, say, the player having *visited* three particular pages and *notVisited* three others. Here you would need to copy and paste the *criteria* variables so that you had two blocks of *criteria* in your **pageTransition** file: the relationship between these two blocks is always set to *AND*.<br><br>This is pretty complex, but the logic quickly becomes clear. We would recommend you look at the Hawaiian storyline for *Plantation Lives* in some detail in order to see how these menus of **pageTransitions** work. In the meantime, however, we turn to two final pages in this Tutorial, starting with the files you require in order to begin creating your own storyline."
}
