{
  "id": null,
  "numberOfColumns": 8,
  "offsetColumns": 2,
  "renderOrder": 1,
  "showInNotebook": false,
  "showInNotebookAt": null,
  "page": null,
  "markdownContent": "One way to have characters in your game communicate with the player is the mailing function. To have a mail enter a player's Inbox while they are on a particular page, there have to be both a `mail.json` file and a `character.json` file. The former defines the contents and the way the mail will be delivered. If you take a look at the `mail1.json` in the repository folder for page T1.4 you'll see multiple variables which you don't yet know. *from* defines the character who sent you the mail and contains the path to the `character.json` file. The `character.json` file, in turn, contains the first and last name of the sender---they don't need to have both---and any relevant salutations: remember the general rule (*Ed: it's not provable*) that the less important the person, the more they insist on a salutation...<br><br>Returning to the `mail.json` file, you can decide the time after loading the page when the mail should be received. For the example mail on this page, it's 10: in other words,  10 seconds after arriving on this page a mail notification should appear in your screen's upper right corner. If you want to the mail to appear as soon as the player enters the page, you'd set the time value to 0. With *openOnReceive* you can define if the mail should work like a pop-up, so as soon as it's delivered the player is interrupted and the inbox opens by itself, or---like the example mail on this page---it simply appears as a notification, for the player to open by clicking on their Inbox icon whenever they want.<br><br>The contents of the mail are controlled with *subject* and *body*, which should be self-explanatory. If you want to refer to the player's name in the mail you can use `{{user.firstName}}` and `{{user.lastName}}` to do so. This only works inside mails as of now, so if you'd try this in a **textComponent** it would render as `{{user.firstName}}` (again, Rome wasn't built in a day). In chapter 2 of this Tutorial game (this is, in narrative terms, called *building the tension*), we'll show you how to prevent a player from transitioning to the next page until they have answered a particular email.<br><br>For now, however, the next page will discuss the dialogue function of *Marugoto*, which is the other primary form of communication between characters and the player. (In narrative terms, this is a *cliffhanger*. Sort of.)"
}
